alrenyang/stm32h743zit6_TRI/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define F_DATA0_Pin GPIO_PIN_2
#define F_DATA0_GPIO_Port GPIOE
#define F_DATA1_Pin GPIO_PIN_3
#define F_DATA1_GPIO_Port GPIOE
#define F_DATA2_Pin GPIO_PIN_4
#define F_DATA2_GPIO_Port GPIOE
#define F_DATA3_Pin GPIO_PIN_5
#define F_DATA3_GPIO_Port GPIOE
#define F_DATA4_Pin GPIO_PIN_6
#define F_DATA4_GPIO_Port GPIOE
#define F_DATA5_Pin GPIO_PIN_13
#define F_DATA5_GPIO_Port GPIOC
#define F_DATA6_Pin GPIO_PIN_14
#define F_DATA6_GPIO_Port GPIOC
#define F_DATA7_Pin GPIO_PIN_15
#define F_DATA7_GPIO_Port GPIOC
#define F_DATA8_Pin GPIO_PIN_6
#define F_DATA8_GPIO_Port GPIOF
#define F_DATA9_Pin GPIO_PIN_7
#define F_DATA9_GPIO_Port GPIOF
#define F_DATA10_Pin GPIO_PIN_8
#define F_DATA10_GPIO_Port GPIOF
#define F_DATA11_Pin GPIO_PIN_9
#define F_DATA11_GPIO_Port GPIOF
#define LCD_BAK_Pin GPIO_PIN_0
#define LCD_BAK_GPIO_Port GPIOA
#define KEY_DATA3_Pin GPIO_PIN_2
#define KEY_DATA3_GPIO_Port GPIOB
#define F_DATA12_Pin GPIO_PIN_12
#define F_DATA12_GPIO_Port GPIOB
#define F_DATA13_Pin GPIO_PIN_14
#define F_DATA13_GPIO_Port GPIOB
#define F_DATA14_Pin GPIO_PIN_15
#define F_DATA14_GPIO_Port GPIOB
#define F_DATA15_Pin GPIO_PIN_11
#define F_DATA15_GPIO_Port GPIOD
#define F_CS_Pin GPIO_PIN_2
#define F_CS_GPIO_Port GPIOG
#define F_WR_Pin GPIO_PIN_3
#define F_WR_GPIO_Port GPIOG
#define KEY_DATA0_Pin GPIO_PIN_11
#define KEY_DATA0_GPIO_Port GPIOA
#define KEY_DATA1_Pin GPIO_PIN_12
#define KEY_DATA1_GPIO_Port GPIOA
#define KEY_DATA2_Pin GPIO_PIN_15
#define KEY_DATA2_GPIO_Port GPIOA
#define LOCK_KEY_Pin GPIO_PIN_2
#define LOCK_KEY_GPIO_Port GPIOD
#define LOCAL_KEY_Pin GPIO_PIN_4
#define LOCAL_KEY_GPIO_Port GPIOD
#define REMOTE_KEY_Pin GPIO_PIN_7
#define REMOTE_KEY_GPIO_Port GPIOD
#define F_RD_Pin GPIO_PIN_9
#define F_RD_GPIO_Port GPIOG
#define F_ALE_Pin GPIO_PIN_10
#define F_ALE_GPIO_Port GPIOG
#define HEART_BEAT_Pin GPIO_PIN_12
#define HEART_BEAT_GPIO_Port GPIOG
#define KEY_DATA4_Pin GPIO_PIN_3
#define KEY_DATA4_GPIO_Port GPIOB
#define EN_A_Pin GPIO_PIN_4
#define EN_A_GPIO_Port GPIOB
#define EN_B_Pin GPIO_PIN_5
#define EN_B_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
